# Form Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Form Methods
Form Class See Also
---
The Form type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddEdge(Reference, Reference) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points. |
| AddEdge(Reference, XYZ) | Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face. |
| AddEdge(Reference, Double, Reference, Double) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param. |
| AddProfile | Add a profile into the form, by a specified edge/param. |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveAnalyticalModel | Indicates whether the Element can have an Analytical Model.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| CanManipulateProfile | Tell if a profile can be deleted/moved/rotated. |
| CanManipulateSubElement | Tell if a sub element can be deleted/moved/rotated/scaled. |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| ConstrainProfiles | Constrain form profiles using the specified profile as primary. This is an advanced version of property "AreProfilesConstrained", allowing specify the primary profile. |
| DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
| DeleteProfile | Delete a profile of the form. |
| DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
| DeleteSubElement | Delete a face/edge/curve/vertex of the form, specified by a reference. |
| DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
| Dispose | (Inherited from Element.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAnalyticalModel | Retrieves writeable Analytical Model for Element.  (Inherited from Element.) |
| GetAnalyticalModelId | Retrieves the Element Id of the Analytical Model Element for this Element.  (Inherited from Element.) |
| GetControlPoints | Given an edge or a curve or a face, return all control points lying on it (in form of geometry references). |
| GetCurvesAndEdgesReference | Given a point, return all edges and curves that it is lying on. |
| GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
| GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
| GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
| GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferences | Gets the full map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
| GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
| GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
| GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
| GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
| GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
| GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
| GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
| GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
| GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
| GetPathCurveIndexByCurveReference | Given a reference to certain curve in the path, return its index. |
| GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
| GetProfileAndCurveLoopIndexFromReference | Given a reference to certain curve or edge, get the index of its profile and curve loop respectively. |
| GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
| GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
| GetVisibility | Gets the visibility for the generic form. (Inherited from GenericForm.) |
| HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
| IsAutoCreaseEdge | Tell if an edge is an auto-crease on a top/bottom cap face. |
| IsBeginningFace | Given a face, tell if it is a beginning cap face. |
| IsConnectingEdge | Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles. |
| IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsCurveReference | Tell if the pick is the reference to a curve of the form. |
| IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsEdgeReference | Tell if the pick is the reference to an edge of the form. |
| IsEndFace | Given a face, tell if it is an end cap face. |
| IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
| IsFaceReference | Tell if the pick is the reference to a face of the form. |
| IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
| IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
| IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
| IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
| IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
| IsProfileEdge | Tell if an edge or curve is generated from a profile. |
| IsReferenceOnlyProfile | Tell if the profile is made by referencing existing geometry in the Revit model. |
| IsSideFace | Given a face, tell if it is a side face. |
| IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
| IsVertexReference | Tell if the pick is the reference to a vertex of the form. |
| LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
| MoveProfile | Move a profile of the form, specified by a reference, and an offset vector. |
| MoveSubElement | Move a face/edge/curve/vertex of the form, specified by a reference, and an offset vector. |
| RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
| RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
| Rehost(Reference, XYZ) | Rehost Form to edge, face or curve. |
| Rehost(SketchPlane, XYZ) | Rehost Form to sketch plane |
| RotateProfile | Rotate a profile of the form, by a specified angle around a given axis. |
| RotateSubElement | Rotate a face/edge/curve/vertex of the form, by a specified angle around a given axis. |
| ScaleProfile | Scale a profile of the form, by a specified origin and scale factor. |
| ScaleSubElement | Scale a face/edge/curve/vertex of the form, by a specified origin and scale factor. |
| SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
| SetVisibility | Sets the visibility for the generic form. (Inherited from GenericForm.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
Form Class
Autodesk.Revit.DB Namespace